{
    "intents": [
        {
            "tags": ["greeting"],
            "patterns": ["Hi there", "How are you", "Is anyone there?", "Hey", "Hola", "Hello", "Good day"],
            "responses": ["Hello", "Good to see you again", "Hi there, how can I help?"],
            "context": [""]
        },
        {
            "tags": ["goodbye"],
            "patterns": ["Bye", "See you later", "Goodbye", "Nice chatting to you, bye", "Till next time","cya"],
            "responses": ["See you!", "Have a nice day", "Bye! Come back again soon."],
            "context": [""]
        },
        {
            "tags": ["thanks"],
            "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"],
            "responses": ["My pleasure", "You're Welcome"],
            "context": [""]

        },
        

        {
            "tags": ["query"],
            "patterns": ["What is NeuroSight?"],
            "responses": ["NeuroSight is an online mri/ct scan analysis"],
            "context": [""]
        },
        
        {
                    "tags": ["how_mri_scanner_work"],
                    "patterns": ["How Does The MRI Scanner Work?", "Can you explain how MRI works?", "What is the principle behind MRI?"],
                    "responses": ["Your body is composed of small particles called atoms. Most of the body is composed of Hydrogen atoms that under normal circumstances spin around at random. However, when you are placed within a strong magnetic field, the hydrogen atoms line up and spin in the same direction as the magnetic field. When a radio frequency wave is transmitted through the tissues in the body, the Hydrogen atoms produce a signal. These signals are measured to produce an image."],
                    "context": [""]
                },
                {
                    "tags": ["why_mri_important"],
                    "patterns": ["Why Is MRI Important?", "What are the benefits of MRI?", "Why should I choose MRI over other imaging techniques?"],
                    "responses": ["This technology is important because MRI scans illustrate more clearly than ever before, the difference between healthy and diseased tissue, and can provide important information about the brain, spine, joints, and internal organs. It can lead to early detection and treatment of disease and has no known side effects. Consequently, your physician will be better able to determine the most appropriate treatment for you."],
                    "context": [""]
                },
                {
                    "tags": ["what_causes_noise","noise"],
                    "patterns": ["What Causes The Noise In The Scanner?", "Why is there noise during an MRI scan?", "Can you explain the source of MRI scanner noise?"],
                    "responses": ["The noise that the scanner creates is the electrical current rising within the wires of the gradient magnet. The current in the wires is opposing the main magnet field; the stronger the field, the louder the gradient noise."],
                    "context": [""]
                },
                {
                    "tags": ["will_it_hurt","get_hurt"],
                    "patterns": ["Will It Hurt?", "Is MRI scan painful?", "Do I need to be concerned about pain during MRI?"],
                    "responses": ["No. You will not feel anything. A call button will be given to you before the exam is started. It will allow you to maintain two-way communication with the technologist at any time during the exam."],
                    "context": [""]
                },
                {
                    "tags": ["difference_between_mri_ct"],
                    "patterns": ["What Is The Difference Between MRI And CT?", "Can you compare MRI and CT scans?", "How are MRI and CT scans different?"],
                    "responses": ["Both MRI and CT create cross-sectional images of the body. The main difference is that MRI uses a large magnet and radio waves to produce images, whereas a CT scanner uses ionizing radiation. The systems complement each other well as they both have their inherent strengths and weaknesses. CT, however, can only directly acquire transverse and coronal images, whereas MRI can directly acquire slices in any plane and is superior when it comes to soft tissue contrast."],
                    "context": [""]
                },
                {
                    "tags": ["scan_entire_body"],
                    "patterns": ["Can You Scan My Entire Body While I Am In There?", "Is whole-body MRI scanning possible?", "Can you perform a full-body MRI scan?"],
                    "responses": ["No. The MR scanner can scan almost any part of the body, but each scan is limited to a specific area. It can take from 30-60 minutes to scan each area."],
                    "context": [""]
                },
                {
                    "tags": ["whole_body_scanning","whole_body_scanned"],
                    "patterns": ["Why Is My Whole Body In The Scanner If You Are Only Scanning My Head?", "Why do I need to be fully inside the MRI scanner for a head scan?","why does my whole body go in"],
                    "responses": ["The area of the scanner that creates the images is located in the center of the magnet and is called the isocenter. Therefore, in order to scan your head, most of your upper body will be in the scanner. The same is true when imaging the spine and upper extremities."],
                    "context": [""]
                },
                {
                    "tags": ["weight_size_limit"],
                    "patterns": ["Does The MRI Table Have A Weight And Size Limit?", "Is there a weight restriction for MRI scans?"],
                    "responses": ["Yes, the table weight limit is 250kg with a maximum width of 70cm. For optimal images, it is necessary for the area being examined to be within the magnet's isocenter, which is located directly in the center of the scanner. For patient-specific questions, please contact our MRI bookings department."],
                    "context": [""]
                },
                
                        {
                            "tags": ["scan_with_contrast", "contrast_scan", "prescribed_scan"],
                            "patterns": ["My doctor has prescribed a scan with contrast – what is it and why is it required?"],
                            "responses": ["A contrast scan involves the use of a liquid dye injected into your veins or administered orally. This dye helps highlight body structures and blood vessels, providing clearer images for diagnosis."],
                            "context": [""]
                        },
                        {
                            "tags": ["scan_duration", "duration", "scan_time"],
                            "patterns": ["What is the duration of the scan?","hoe long will the scan last"],
                            "responses": ["The duration varies depending on the type of scan. A CT scan typically takes 15-60 minutes, while an MRI takes around 15-90 minutes. CT scans with contrast may require you to drink a contrast agent 45 minutes before the scan."],
                            "context": [""]
                        },
                        {
                            "tags": ["instructions_before_mri", "mri_preparation", "mri_safety","prepare_for_mri"],
                            "patterns": ["Any important instructions before I undergo an MRI?","what preperations should we do before going to a ct scan"],
                            "responses": ["Before an MRI, remove all metal items from your body. Wear the hospital gown provided, and follow staff instructions carefully. Inform staff if you have a pacemaker or electrical implants, as these cannot enter the MRI room."],
                            "context": [""]
                        },
                        {
                            "tags": ["instructions_before_ct", "ct_preparation", "ct_safety","prepare_for_ct"],
                            "patterns": ["Any important instructions for a CT scan?","what preperations should we do before going to a ct scan"],
                            "responses": ["For a CT scan, avoid wearing metal items. Fasting may be required before a scan with contrast. Patients above 40 need a serum creatinine report. Follow staff instructions to ensure a successful scan."],
                            "context": [""]
                        },
                        {
                            "tags": ["report_delivery", "scan_reports"],
                            "patterns": ["When will I receive my reports?", "when will my reports be available"],
                            "responses": ["A CD of your scan will be available 20 minutes post-procedure. Hard copy reports take 4-5 hours for analysis. Soft copies are emailed within 4-5 hours. You'll receive an SMS when reports are ready."],
                            "context": [""]
                        }
                    ]
                }     